app/Controllers/Home.php

SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 1 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
---
            ->findAll();

        $model = new QuestionModel();
        $data['perQuestion1'] = $model
            ->select('
        department_tbl.department,
        COUNT(CASE WHEN responses.question_id = 1 THEN 1 END) AS total_responses,
        SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS agree_count,
        SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS disagree_count,
        SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS neither_agree_nor_disagree,
        SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS strongly_agree_count,
        SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 1 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 1 THEN 1 END), 0) AS strongly_disagree_count
    ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();

SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 2 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 3 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 4 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 5 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 6 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 7 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
SELECT `department_tbl`.`department`, COUNT(CASE WHEN responses.question_id = 8 THEN 1 END) AS total_responses, SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS agree_count, SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS disagree_count, SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS neither_agree_nor_disagree, SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS strongly_agree_count, SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS strongly_disagree_count
FROM `responses`
JOIN `department_tbl` ON `responses`.`department_id` = `department_tbl`.`department_id`
JOIN `respondent_tbl` ON `responses`.`respondent_id` = `respondent_tbl`.`id`
WHERE `responses`.`department_id` = '1'
GROUP BY `department_tbl`.`department`
ORDER BY `department_tbl`.`department`
---


        $model = new QuestionModel();
        $data['perQuestion2'] = $model
            ->select('
            department_tbl.department,
            COUNT(CASE WHEN responses.question_id = 2 THEN 1 END) AS total_responses,
            SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS agree_count,
            SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS disagree_count,
            SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS neither_agree_nor_disagree,
            SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS strongly_agree_count,
            SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 2 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 2 THEN 1 END), 0) AS strongly_disagree_count
        ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();

        $model = new QuestionModel();
        $data['perQuestion3'] = $model
            ->select('
                department_tbl.department,
                COUNT(CASE WHEN responses.question_id = 3 THEN 1 END) AS total_responses,
                SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS agree_count,
                SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS disagree_count,
                SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS neither_agree_nor_disagree,
                SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS strongly_agree_count,
                SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 3 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 3 THEN 1 END), 0) AS strongly_disagree_count
            ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();

        $model = new QuestionModel();
        $data['perQuestion4'] = $model
            ->select('
                    department_tbl.department,
                    COUNT(CASE WHEN responses.question_id = 4 THEN 1 END) AS total_responses,
                    SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS agree_count,
                    SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS disagree_count,
                    SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS neither_agree_nor_disagree,
                    SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS strongly_agree_count,
                    SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 4 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 4 THEN 1 END), 0) AS strongly_disagree_count
                ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();

        $model = new QuestionModel();
        $data['perQuestion5'] = $model
            ->select('
                        department_tbl.department,
                        COUNT(CASE WHEN responses.question_id = 5 THEN 1 END) AS total_responses,
                        SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS agree_count,
                        SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS disagree_count,
                        SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS neither_agree_nor_disagree,
                        SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS strongly_agree_count,
                        SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 5 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 5 THEN 1 END), 0) AS strongly_disagree_count
                    ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();

        // Query for Question 6
        $model = new QuestionModel();
        $data['perQuestion6'] = $model
            ->select('
           department_tbl.department,
           COUNT(CASE WHEN responses.question_id = 6 THEN 1 END) AS total_responses,
           SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS agree_count,
           SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS disagree_count,
           SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS neither_agree_nor_disagree,
           SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS strongly_agree_count,
           SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 6 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 6 THEN 1 END), 0) AS strongly_disagree_count
       ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();

        // Query for Question 7
        $model = new QuestionModel();
        $data['perQuestion7'] = $model
            ->select('
                department_tbl.department,
                COUNT(CASE WHEN responses.question_id = 7 THEN 1 END) AS total_responses,
                SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS agree_count,
                SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS disagree_count,
                SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS neither_agree_nor_disagree,
                SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS strongly_agree_count,
                SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 7 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 7 THEN 1 END), 0) AS strongly_disagree_count
            ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();

        // Query for Question 8
        $model = new QuestionModel();
        $data['perQuestion8'] = $model
            ->select('
                department_tbl.department,
                COUNT(CASE WHEN responses.question_id = 8 THEN 1 END) AS total_responses,
                SUM(CASE WHEN responses.response_value = "Agree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS agree_count,
                SUM(CASE WHEN responses.response_value = "Disagree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS disagree_count,
                SUM(CASE WHEN responses.response_value = "Neither Agree nor Disagree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS neither_agree_nor_disagree,
                SUM(CASE WHEN responses.response_value = "Strongly Agree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS strongly_agree_count,
                SUM(CASE WHEN responses.response_value = "Strongly Disagree" AND responses.question_id = 8 THEN 1 ELSE 0 END) * 100.0 / NULLIF(COUNT(CASE WHEN responses.question_id = 8 THEN 1 END), 0) AS strongly_disagree_count
            ')
            ->join('department_tbl', 'responses.department_id = department_tbl.department_id')
            ->join('respondent_tbl', 'responses.respondent_id = respondent_tbl.id')
            ->where('responses.department_id', $department_id)
            ->groupBy('department_tbl.department')
            ->orderBy('department_tbl.department')
            ->findAll();