app/Controllers/Survey.php

    public function loadQuestions()
    {
        if (session()->get('isLoggedIn'))
    {

        $queryQuestion = $this->db->table('questions_tbl')->get();
        $queryDepartment = $this->db->table('department_tbl')->get();
---
SELECT *
FROM `questions_tbl`
SELECT *
FROM `department_tbl`

    public function submitResponseDept()
    {
        // Capture the form data

        $fullName = $this->request->getPost('respondent_name');
        $gend = $this->request->getPost('gender');
        $agee = $this->request->getPost('age');
        $reg = $this->request->getPost('region');
        $service = $this->request->getPost('service_feedback');
        $departmentId = $this->request->getPost('department_id');
        $clienttype = $this->request->getPost('client_type');

        // Insert into 'respondent_tbl'
        $respondentData = [
            'respondent_name' => $fullName,
            'area_went' => $departmentId,
            'gender' => $gend,
            'age' => $agee,
            'region' => $reg,
            'service_feedback' => $service,
            'client_type' => $clienttype,
            'created_at' => date('Y-m-d H:i:s')
        ];

        $this->db->table('respondent_tbl')->insert($respondentData);
---
INSERT INTO `respondent_tbl` (`respondent_name`, `area_went`, `gender`, `age`, `region`, `service_feedback`, `client_type`, `created_at`) VALUES ('Gene', '1', 'Male', '18', '2', 'Okay ang mga Empleyado. matulungin at mababait.', 'Citizen', '2024-12-16 06:58:10')

            'created_at' => (new \CodeIgniter\I18n\Time())->addHours(8)->toDateTimeString()
        ];

        $this->db->table('notifications')->insert($notificationData);
---
INSERT INTO `notifications` (`respondent_id`, `user_id`, `message`, `is_read`, `created_at`) VALUES (21, '1', 'New response by Gene', 0, '2024-12-16 14:58:10')

                    'department_id' => $departmentId,
                    'created_at' => date('Y-m-d H:i:s')
                ];
                $this->db->table('responses')->insert($data);
---
INSERT INTO `responses` (`question_id`, `response_value`, `respondent_id`, `department_id`, `created_at`) VALUES ('1', 'Strongly Agree', 21, '1', '2024-12-16 06:58:10')

    public function getNotifications()
    {
        $userId = session()->get('id'); // Assuming user is logged in and user_id is stored in the session

        if (!$userId) {
            return $this->response->setStatusCode(400, 'User not logged in');
        }

        // Query to fetch unread notifications for the logged-in user
        $notifications = $this->db->table('notifications')
            ->where('user_id', $userId)
            ->where('is_read', false) // Assuming 'is_read' column for unread notifications
            ->orderBy('created_at', 'desc') // Order notifications by creation date
            ->get()
            ->getResultArray();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '1'
AND `is_read` = 0
ORDER BY `created_at` DESC