app/Models/SurveyModel.php

SELECT `department_tbl`.`department` AS `department`, COUNT(*) AS total_responses, SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count, SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count, SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count, SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count, SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count
FROM `survey_responses`
JOIN `department_tbl` ON `survey_responses`.`department_id` = `department_tbl`.`department_id`
GROUP BY `survey_responses`.`department_id`
---
    public function getCounts()
    {
        return $this->select('
                department_tbl.department AS department,
                COUNT(*) AS total_responses,

                SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count,
                SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count,
                SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count,
                SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count,
                SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count
            ')
            ->join('department_tbl', 'survey_responses.department_id = department_tbl.department_id')
            ->groupBy('survey_responses.department_id')
            ->findAll();

SELECT `department_tbl`.`department` AS `department`, COUNT(*) AS total_responses, SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count, SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count, SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count, SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count, SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count
FROM `survey_responses`
JOIN `department_tbl` ON `survey_responses`.`department_id` = `department_tbl`.`department_id`
WHERE `survey_responses`.`created_at` >= '2024-12-16 00:00:00'
AND `survey_responses`.`created_at` <= '2024-12-16 23:59:59'
GROUP BY `survey_responses`.`department_id`
---
    public function getTodayCounts()
{
    $todayStart = date('Y-m-d 00:00:00'); // Start of today
    $todayEnd = date('Y-m-d 23:59:59');   // End of today

    return $this->select('
            department_tbl.department AS department,
            COUNT(*) AS total_responses,
            SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count,
            SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count,
            SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count,
            SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count,
            SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count
        ')
        ->join('department_tbl', 'survey_responses.department_id = department_tbl.department_id')
        ->where('survey_responses.created_at >=', $todayStart)
        ->where('survey_responses.created_at <=', $todayEnd)
        ->groupBy('survey_responses.department_id')
        ->findAll();

SELECT `department_tbl`.`department` AS `department`, COUNT(*) AS total_responses, SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count, SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count, SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count, SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count, SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count
FROM `survey_responses`
JOIN `department_tbl` ON `survey_responses`.`department_id` = `department_tbl`.`department_id`
WHERE `survey_responses`.`created_at` >= '2024-12-09 06:58:49'
GROUP BY `survey_responses`.`department_id`
---
    public function getWeeklyCounts()
    {
        $oneWeekAgo = date('Y-m-d H:i:s', strtotime('-7 days')); // Calculate the date one week ago

        return $this->select('
                department_tbl.department AS department,
                COUNT(*) AS total_responses,
                SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count,
                SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count,
                SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count,
                SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count,
                SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count
            ')
            ->join('department_tbl', 'survey_responses.department_id = department_tbl.department_id')
            ->where('survey_responses.created_at >=', $oneWeekAgo) // Filter for responses in the last week
            ->groupBy('survey_responses.department_id')
            ->findAll();

SELECT `department_tbl`.`department` AS `department`, COUNT(*) AS total_responses, SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count, SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count, SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count, SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count, SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count
FROM `survey_responses`
JOIN `department_tbl` ON `survey_responses`.`department_id` = `department_tbl`.`department_id`
WHERE `survey_responses`.`created_at` >= '2024-11-16 06:58:49'
GROUP BY `survey_responses`.`department_id`
---
    public function getMonthlyCounts()
{
    $oneMonthAgo = date('Y-m-d H:i:s', strtotime('-30 days')); // Calculate the date one month ago

    return $this->select('
            department_tbl.department AS department,
            COUNT(*) AS total_responses,
            SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count,
            SUM(CASE WHEN satisfaction = "Agree" THEN 1 ELSE 0 END) AS satisfaction_agree_count,
            SUM(CASE WHEN satisfaction = "Neither_agree_nor_dissatisfied" THEN 1 ELSE 0 END) AS satisfaction_neither_count,
            SUM(CASE WHEN satisfaction = "Disagree" THEN 1 ELSE 0 END) AS satisfaction_disagree_count,
            SUM(CASE WHEN satisfaction = "Strongly_Disagree" THEN 1 ELSE 0 END) AS satisfaction_strongly_disagree_count

        ')
        ->join('department_tbl', 'survey_responses.department_id = department_tbl.department_id')
        ->where('survey_responses.created_at >=', $oneMonthAgo) // Filter for responses in the last month
        ->groupBy('survey_responses.department_id')
        ->findAll();

SELECT `department_tbl`.`department` AS `department`, COUNT(*) AS total_responses, SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count
FROM `survey_responses`
JOIN `department_tbl` ON `survey_responses`.`department_id` = `department_tbl`.`department_id`
GROUP BY `survey_responses`.`department_id`
---
public function countperQuestion()
    {
        return $this->select('
                department_tbl.department AS department,
                COUNT(*) AS total_responses,

                SUM(CASE WHEN satisfaction = "Strongly_Agree" THEN 1 ELSE 0 END) AS satisfaction_strongly_agree_count,

            ')
            ->join('department_tbl', 'survey_responses.department_id = department_tbl.department_id')
            ->groupBy('survey_responses.department_id')
            ->findAll();